text = {
    "welcome": "Привет, что бы начать меня использовать тебе необходимо пройти регистарацию",
    "welcome_back": "Привет!",
    "text_registration": "Для того что бы использова бота вам необходимо зарегистрироваться",
    "button_registration": "Пройти регистрацию",

    'button_send_code': "Отправить код",
    'button_retry_send_code': "Отправить код ещё раз",

    'start_send_code': "Для того что бы использова бота вам необходимо подтвердить свой почту.",
    'send_code': "Мы отправили вам код подтверждения, как получите отправте его нам.",

    "get_email": "Ваша почта?",
    "bad_email": "Неправильная почта, попробуй ещё раз",
    'already_email': "Вы уже подтвердили свой почтовый ящик. Возможно что то пошло не так воспользуйся /start",

    'get_name': "Как вас величают?",
    'bad_name': "Что-то ты перемудрил, попробуй ещё раз. Длина от 1 до 16, не используй смайлики, пиши без пробела",

    'already_registered': "Вы уже зарегистрированы!",
    'service_unavailable': "Сервис недоступен, что бы попробовать снова напиши /start",
    'start_registration': "Здорово, начинем процесс регистрации.",
    'button_confirm': "Подтвердить",
    'confirm_email': "Почти готово, необходимо подтвердить свой почтовый ящик",
    'find_ac': "О, мы нашли вас, для того что бы связать аккаунт с вашей телегой, мы выслали вам на почту код подтверждения, введите его.",
    'finish_link': "Ваш аккаунт успешно привязан.",
    'retry_send_code': "Отправить код ещё раз",
    'bad_code': "Неверный код, попробуй ещё раз",
    'already_link': "Ваш аккаунт уже привязан. Пропишите /start, что бы начать сначала.",
    'confirm_code': "Мы отправили вам код подтверждения, как получите отправте его нам.",

    "button_profile": "Профиль",
    'button_info': "Информация",

    'text_profile': 'Привет, {name} \n\nВаш баланс: {balance} секунд',
    'button_add_balance': "Пополнить баланс",
    'add_balance': "Сколько секунд вы хотите пополнить?",
    'bad_balance': 'Неправильное количество секунд, попробуй ещё раз',
    'balance_added': "Баланс пополнен на {balance} секунд",

    'button_back': "Назад",

    'button_transactions': "История транзакций",
    "text_transactions": 'Ваша история транзакций:',

    'error': "Произошла ошибка, попробуйте позже.",
}
